In [164]:
#path = '/content/drive/MyDrive/NIBRS/agencies.csv'
path = 'C:/NIBRS/2022/agencies.csv'

In [165]:
import pandas as pd
import numpy as np

In [166]:
agencies = pd.read_csv(path)

In [167]:
agencies.head()

,yearly_agency_id,agency_id,data_year,ori,legacy_ori,covered_by_legacy_ori,direct_contributor_flag,dormant_flag,dormant_year,reporting_type,...,nibrs_leoka_start_date,nibrs_ct_start_date,nibrs_multi_bias_start_date,nibrs_off_eth_start_date,covered_flag,county_name,msa_name,publishable_flag,participated,nibrs_participated
0,56882022,5688,2022,IN0020000,IN0020000,NaN,N,N,NaN,I,...,2020-09-01,2021-01-01,2021-01-01,2021-01-01,N,ALLEN,"Fort Wayne, IN",Y,Y,Y
1,56892022,5689,2022,IN0020100,IN0020100,NaN,N,N,NaN,I,...,2020-09-01,2021-01-01,2021-01-01,2021-01-01,N,ALLEN,"Fort Wayne, IN",Y,Y,Y
2,56902022,5690,2022,IN0020200,IN0020200,NaN,N,N,NaN,I,...,2020-09-01,2021-01-01,2021-01-01,2021-01-01,N,ALLEN,"Fort Wayne, IN",Y,Y,Y
3,56912022,5691,2022,IN0030000,IN0030000,NaN,N,N,NaN,I,...,2020-11-01,2021-01-01,2021-01-01,2021-01-01,N,BARTHOLOMEW,"Columbus, IN",Y,Y,Y
4,56952022,5695,2022,IN0050000,IN0050000,NaN,N,N,NaN,I,...,2019-01-01,2020-03-01,2020-03-01,2020-03-01,N,BLACKFORD,Not Specified,Y,Y,Y

In [168]:
agencies_final = agencies[['agency_id','county_name']]

In [169]:
agencies_final.head()

   agency_id  county_name
0       5688        ALLEN
1       5689        ALLEN
2       5690        ALLEN
3       5691  BARTHOLOMEW
4       5695    BLACKFORD

In [170]:
path4 = 'C:/NIBRS/2022/NIBRS_VICTIM.csv'

In [171]:
victim = pd.read_csv(path4)

In [172]:
victim.head()

,data_year,victim_id,incident_id,victim_seq_num,victim_type_id,assignment_type_id,activity_type_id,outside_agency_id,age_id,age_num,sex_code,race_id,ethnicity_id,resident_status_code,age_range_low_num,age_code_range_high
0,2022,166275722,150665449,1,4,NaN,NaN,NaN,78,75,M,10,50,NaN,75.0,NaN
1,2022,166275620,150665362,1,4,NaN,NaN,NaN,64,61,M,10,50,NaN,61.0,NaN
2,2022,166275780,150665492,1,4,NaN,NaN,NaN,46,43,F,10,50,NaN,43.0,NaN
3,2022,166275615,150665358,1,5,7.0,1.0,NaN,44,41,F,20,50,NaN,41.0,NaN
4,2022,166275652,150665387,1,4,NaN,NaN,NaN,31,28,M,20,20,NaN,28.0,NaN

In [173]:
victim_final = victim[['victim_id','incident_id','age_num']]

In [174]:
victim_final.head()

   victim_id  incident_id age_num
0  166275722    150665449      75
1  166275620    150665362      61
2  166275780    150665492      43
3  166275615    150665358      41
4  166275652    150665387      28

In [175]:
path2 = 'C:/NIBRS/2022/NIBRS_OFFENSE.csv'

In [176]:
offense = pd.read_csv(path2)

In [177]:
offense.head()

,data_year,offense_id,incident_id,offense_code,attempt_complete_flag,location_id,num_premises_entered,method_entry_code
0,2022,180591817,150665449,220,C,35,NaN,F
1,2022,180591717,150665362,13B,C,35,NaN,NaN
2,2022,180591869,150665492,13C,C,35,NaN,NaN
3,2022,180591712,150665358,13B,C,35,NaN,NaN
4,2022,180591748,150665387,23G,C,35,NaN,NaN

In [178]:
offense_final = offense[["offense_id",'offense_code','incident_id']]

In [179]:
offense_final.head()

   offense_id offense_code  incident_id
0   180591817          220    150665449
1   180591717          13B    150665362
2   180591869          13C    150665492
3   180591712          13B    150665358
4   180591748          23G    150665387

In [180]:
path8 = 'C:/NIBRS/2022/population.csv'

In [181]:
population = pd.read_csv(path8)

In [182]:
population

  county_name   Total:     55+
0       BOONE   69,839   18305
1    HAMILTON  341,616   83101
2     HANCOCK   78,616   23357
3   HENDRICKS  172,100   45241
4     JOHNSON  159,739   42987
5      MARION  969,542  237183
6      MORGAN   71,394   22957
7      SHELBY   44,825   14273

In [183]:
path3 = 'C:/NIBRS/2022/NIBRS_incident.csv'

In [184]:
incident = pd.read_csv(path3)

In [185]:
incident.head()

,data_year,agency_id,incident_id,nibrs_month_id,cargo_theft_flag,submission_date,incident_date,report_date_flag,incident_hour,cleared_except_id,cleared_except_date,incident_status,data_home,orig_format,did
0,2022,5688,150665449,44070783,f,2022-03-14 10:08:45.251,2022-01-01,f,13,6,NaN,ACCEPTED,NaN,F,134214216
1,2022,5688,150665362,44070783,f,2022-03-14 10:08:44.767,2022-01-01,f,15,6,NaN,ACCEPTED,NaN,F,134214020
2,2022,5688,150665492,44070783,f,2022-03-14 10:08:45.543,2022-01-01,f,22,6,NaN,ACCEPTED,NaN,F,134214312
3,2022,5688,150665358,44070783,f,2022-03-14 10:08:44.732,2022-01-01,f,22,6,NaN,ACCEPTED,NaN,F,134213999
4,2022,5688,150665387,44070783,f,2022-03-14 10:08:44.879,2022-01-02,f,10,6,NaN,ACCEPTED,NaN,F,134214074

In [186]:
incident_final = incident[["incident_id",'agency_id']]

In [187]:
incident_final.head()

   incident_id  agency_id
0    150665449       5688
1    150665362       5688
2    150665492       5688
3    150665358       5688
4    150665387       5688

In [188]:
#incident_final = incident_final.withColumnRenamed("incident_id","incident_ids")

In [189]:
path6 = 'C:/NIBRS/2022/crime_category.csv'

In [190]:
crime = pd.read_csv(path6)

In [191]:
crime.rename(columns = {'Offense_category':'offense_category_name'}, inplace = True)

In [192]:
crime.head()

          offense_category_name Crime_Type
0        Larceny/Theft Offenses   Property
1              Assault Offenses    Violent
2  Burglary/Breaking & Entering   Property
3                Fraud Offenses      Fraud
4           Motor Vehicle Theft   Property

In [193]:
path7 = 'C:/NIBRS/2022/NIBRS_OFFENSE_TYPE.csv'

In [194]:
typeo = pd.read_csv(path7)

In [195]:
typeo.head()

,offense_code,offense_name,crime_against,ct_flag,hc_flag,hc_code,offense_category_name,offense_group
0,09A,Murder and Nonnegligent Manslaughter,Person,f,t,01,Homicide Offenses,A
1,09B,Negligent Manslaughter,Person,f,t,,Homicide Offenses,A
2,09C,Justifiable Homicide,Person,f,f,,Homicide Offenses,A
3,11A,Rape,Person,f,t,02,Sex Offenses,A
4,11B,Sodomy,Person,f,t,02,Sex Offenses,A

In [196]:
typeo_final = typeo[['offense_code','offense_category_name']]

In [197]:
#crime_final.head()

In [198]:
typeo_final.head()

  offense_code offense_category_name
0          09A     Homicide Offenses
1          09B     Homicide Offenses
2          09C     Homicide Offenses
3          11A          Sex Offenses
4          11B          Sex Offenses

In [199]:
crime_final = typeo_final.merge(crime,on = 'offense_category_name', how='left')

In [200]:
crime_final.head()

  offense_code offense_category_name Crime_Type
0          09A     Homicide Offenses    Violent
1          09B     Homicide Offenses    Violent
2          09C     Homicide Offenses    Violent
3          11A          Sex Offenses    Violent
4          11B          Sex Offenses    Violent

In [201]:
offense_final2 = offense_final.merge(crime_final, on = 'offense_code', how = 'left')

In [202]:
offense_final2.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type
0,180591817,220,150665449,Burglary/Breaking & Entering,Property
1,180591717,13B,150665362,Assault Offenses,Violent
2,180591869,13C,150665492,Assault Offenses,Violent
3,180591712,13B,150665358,Assault Offenses,Violent
4,180591748,23G,150665387,Larceny/Theft Offenses,Property

In [203]:
final1 = offense_final2.merge(incident_final, on='incident_id', how='left')

In [204]:
final1.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type,agency_id
0,180591817,220,150665449,Burglary/Breaking & Entering,Property,5688
1,180591717,13B,150665362,Assault Offenses,Violent,5688
2,180591869,13C,150665492,Assault Offenses,Violent,5688
3,180591712,13B,150665358,Assault Offenses,Violent,5688
4,180591748,23G,150665387,Larceny/Theft Offenses,Property,5688

In [205]:
final2 = final1.merge(victim_final, on = 'incident_id', how = 'left')

In [206]:
final2.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type,agency_id,victim_id,age_num
0,180591817,220,150665449,Burglary/Breaking & Entering,Property,5688,166275722,75
1,180591717,13B,150665362,Assault Offenses,Violent,5688,166275620,61
2,180591869,13C,150665492,Assault Offenses,Violent,5688,166275780,43
3,180591712,13B,150665358,Assault Offenses,Violent,5688,166275615,41
4,180591748,23G,150665387,Larceny/Theft Offenses,Property,5688,166275652,28

In [207]:
final3 = final2.merge(agencies_final, on = 'agency_id', how = 'left')

In [208]:
final3.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type,agency_id,victim_id,age_num,county_name
0,180591817,220,150665449,Burglary/Breaking & Entering,Property,5688,166275722,75,ALLEN
1,180591717,13B,150665362,Assault Offenses,Violent,5688,166275620,61,ALLEN
2,180591869,13C,150665492,Assault Offenses,Violent,5688,166275780,43,ALLEN
3,180591712,13B,150665358,Assault Offenses,Violent,5688,166275615,41,ALLEN
4,180591748,23G,150665387,Larceny/Theft Offenses,Property,5688,166275652,28,ALLEN

In [209]:
final3["age_num"] = pd.to_numeric(final3["age_num"], errors = 'coerce')

In [210]:
final3.shape

(273712, 9)

In [211]:
final55 = final3[final3['age_num'] >= 55]
final55 = final3

In [212]:
final55.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type,agency_id,victim_id,age_num,county_name
0,180591817,220,150665449,Burglary/Breaking & Entering,Property,5688,166275722,75.0,ALLEN
1,180591717,13B,150665362,Assault Offenses,Violent,5688,166275620,61.0,ALLEN
2,180591869,13C,150665492,Assault Offenses,Violent,5688,166275780,43.0,ALLEN
3,180591712,13B,150665358,Assault Offenses,Violent,5688,166275615,41.0,ALLEN
4,180591748,23G,150665387,Larceny/Theft Offenses,Property,5688,166275652,28.0,ALLEN

In [213]:
final55.shape

(273712, 9)

In [214]:
#Violent crime
final_violent = final55[final55['Crime_Type'] == 'Violent']

In [215]:
final_violent.shape

(82885, 9)

In [216]:
#Violent crime
final_property = final55[final55['Crime_Type'] == 'Property']

In [217]:
final_property.shape

(112158, 9)

In [218]:
#Fraud Crime
final_fraud = final55[final55['Crime_Type'] == 'Fraud']

In [219]:
final_fraud.shape

(24264, 9)

In [220]:
final_violent.head()

,offense_id,offense_code,incident_id,offense_category_name,Crime_Type,agency_id,victim_id,age_num,county_name
1,180591717,13B,150665362,Assault Offenses,Violent,5688,166275620,61.0,ALLEN
2,180591869,13C,150665492,Assault Offenses,Violent,5688,166275780,43.0,ALLEN
3,180591712,13B,150665358,Assault Offenses,Violent,5688,166275615,41.0,ALLEN
6,180591754,13B,150665393,Assault Offenses,Violent,5688,166275659,13.0,ALLEN
7,180591792,13B,150665426,Assault Offenses,Violent,5688,166275696,35.0,ALLEN

In [221]:
violent = final_violent.groupby(['county_name']).size().reset_index(name='counts')

In [222]:
property = final_property.groupby(['county_name']).size().reset_index(name='counts')

In [223]:
fraud = final_fraud.groupby(['county_name']).size().reset_index(name='counts')

In [224]:
violent_final = population.merge(violent,on = 'county_name', how = 'left')

In [225]:
violent_final

  county_name   Total:     55+   counts
0       BOONE   69,839   18305    433.0
1    HAMILTON  341,616   83101   1765.0
2     HANCOCK   78,616   23357    509.0
3   HENDRICKS  172,100   45241   1532.0
4     JOHNSON  159,739   42987   1103.0
5      MARION  969,542  237183  27719.0
6      MORGAN   71,394   22957      NaN
7      SHELBY   44,825   14273    446.0

In [226]:
violent_final["55+"] = violent_final['55+'].replace(',','', regex=True)

In [227]:
violent_final["55+"] = pd.to_numeric(violent_final["55+"])

In [228]:
violent_final['stat'] = (violent_final['counts']/violent_final['55+'])*1000

In [229]:
violent_final

  county_name   Total:     55+   counts        stat
0       BOONE   69,839   18305    433.0   23.654739
1    HAMILTON  341,616   83101   1765.0   21.239215
2     HANCOCK   78,616   23357    509.0   21.792182
3   HENDRICKS  172,100   45241   1532.0   33.863089
4     JOHNSON  159,739   42987   1103.0   25.658920
5      MARION  969,542  237183  27719.0  116.867566
6      MORGAN   71,394   22957      NaN         NaN
7      SHELBY   44,825   14273    446.0   31.247811

In [230]:
violent_final.to_csv('C:/NIBRS/2022/Violent_crime_2022.csv')

In [231]:
property_final = population.merge(property,on = 'county_name', how = 'left')

In [232]:
property_final

  county_name   Total:     55+   counts
0       BOONE   69,839   18305    572.0
1    HAMILTON  341,616   83101   4145.0
2     HANCOCK   78,616   23357    826.0
3   HENDRICKS  172,100   45241   2637.0
4     JOHNSON  159,739   42987   2757.0
5      MARION  969,542  237183  36620.0
6      MORGAN   71,394   22957      NaN
7      SHELBY   44,825   14273    572.0

In [233]:
property_final["55+"] = property_final['55+'].replace(',','', regex=True)

In [234]:
property_final["55+"] = pd.to_numeric(property_final["55+"])

In [235]:
property_final['stat'] = (property_final['counts']/property_final['55+'])*1000

In [236]:
property_final

  county_name   Total:     55+   counts        stat
0       BOONE   69,839   18305    572.0   31.248293
1    HAMILTON  341,616   83101   4145.0   49.879063
2     HANCOCK   78,616   23357    826.0   35.364131
3   HENDRICKS  172,100   45241   2637.0   58.287836
4     JOHNSON  159,739   42987   2757.0   64.135669
5      MARION  969,542  237183  36620.0  154.395551
6      MORGAN   71,394   22957      NaN         NaN
7      SHELBY   44,825   14273    572.0   40.075667

In [237]:
property_final.to_csv('C:/NIBRS/2022/Property_crime_2022.csv')

In [238]:
fraud_final = population.merge(fraud,on = 'county_name', how = 'left')

In [239]:
fraud_final

  county_name   Total:     55+  counts
0       BOONE   69,839   18305   347.0
1    HAMILTON  341,616   83101  1468.0
2     HANCOCK   78,616   23357   337.0
3   HENDRICKS  172,100   45241   786.0
4     JOHNSON  159,739   42987   640.0
5      MARION  969,542  237183  6577.0
6      MORGAN   71,394   22957     NaN
7      SHELBY   44,825   14273   202.0

In [240]:
fraud_final["55+"] = fraud_final['55+'].replace(',','', regex=True)

In [241]:
fraud_final["55+"] = pd.to_numeric(fraud_final["55+"])

In [242]:
fraud_final['stat'] = (fraud_final['counts']/fraud_final['55+'])*1000

In [243]:
fraud_final

  county_name   Total:     55+  counts       stat
0       BOONE   69,839   18305   347.0  18.956569
1    HAMILTON  341,616   83101  1468.0  17.665251
2     HANCOCK   78,616   23357   337.0  14.428223
3   HENDRICKS  172,100   45241   786.0  17.373621
4     JOHNSON  159,739   42987   640.0  14.888222
5      MARION  969,542  237183  6577.0  27.729643
6      MORGAN   71,394   22957     NaN        NaN
7      SHELBY   44,825   14273   202.0  14.152596

In [244]:
fraud_final.to_csv('C:/NIBRS/2022/Fraud_crime_2022.csv')